int size_i = 500;
int division = 20; 

//座標に関してはdivisionが変化すると対処できないので改良する必要あり
//赤いドットのx座標
int red_x[] = {200,220,240,260,280,-1,180,200,220,240,260,280,300,320,340,-1,-1,-1,-1,-1,-1,220,-1,220,280,-1,220,240,260,280,-1,200,240,260,300,-1,200,220,240,260,280,300,-1,180,200,220,240,260,280,300,320,-1,180,200,220,280,300,320};

int green_x[] = {-1,-1,180,200,220,280,-1,160,200,280,-1,160,200,220,300,-1,160,180,280,300,320,340,-1,-1,180,200,240,260,280,-1,160,180,200,240,260,300,320,340,-1,140,160,180,200,240,260,300,320,340,360,-1,180,320,-1,-1,-1,-1,160,180,200,300,320,340,-1,140,160,180,200,300,320,340,360};

int yellow_x[] = {-1,-1,240,260,300,-1,180,220,240,260,300,320,340,-1,180,240,260,280,320,340,360,-1,200,220,240,260,-1,200,220,240,260,280,300,320,-1,-1,-1,-1,140,160,220,280,340,360,-1,140,160,180,320,340,360,-1,140,160,340,360};


void setup(){
  setupPrint();
  print_dot();
}

//場づくり
void setupPrint(){
  background(140, 140, 245);
  size(size_i, size_i);
  //マス目
  for(int i=0; i<size_i; i+=division){
    stroke(0,0,0);
    line(i, 0, i, size_i);
    line(0, i, size_i, i);
    if(i%100==0){
      stroke(255, 0,0);
      line(i, 0, i, size_i);
      line(0, i, size_i, i);
      noStroke();
      print(i);
    }
  }
}

//描画
void print_dot(){
  dot(red_x, 230, 10, 10);
  dot(green_x, 110, 130, 30);
  dot(yellow_x, 255, 200, 30);
}

//ドットを配列に沿ってうつ
void dot(int point_x[], int r, int g, int b){
  int row = 0;
  
  for(int i=0; i<point_x.length; i++){
    if(point_x[i] != -1){
      fill(r, g, b);
      rect(point_x[i], row, division, division);
      noFill();
    }else{
      row+=division;
    }
  }
}
